app/controllers/admin/emails_controller.rb

INSERT INTO `emails` (`title`, `content`, `created_at`, `updated_at`) VALUES ('测试邮件', '<p><span style=\"color:#FF0000;\">第一次测试</span></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&nbsp; 会当凌绝顶</p>\r\n\r\n<p>&nbsp; 一览众山小</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><img alt=\"\" src=\"/ckeditor_assets/pictures/2/content_9-150319102350.jpg\" style=\"width: 300px; height: 300px;\" /></p>\r\n\r\n<p><span style=\"font-size:20px;\">好</span><strong>玩</strong>不！！！</p>\r\n', '2016-03-19 13:23:51', '2016-03-19 13:23:51')
---
  def create
    @email = Email.new(email_params)
    if @email.save

SELECT  `emails`.* FROM `emails` WHERE `emails`.`id` = 3  ORDER BY `emails`.`created_at` DESC LIMIT 1
---
  def set_email
    @email = Email.find_by(id: params[:id])