app/controllers/admin/reports_controller.rb

  def send_group_emails
    @email_addresses = User.whehere(activated: true).pluck(:email)
    @emails = Email.all
    Rails.logger.info @emails.count
---
SELECT `emails`.* FROM `emails`  ORDER BY `emails`.`created_at` DESC
SELECT COUNT(*) FROM `emails`