app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `password_digest`, `mobile`, `created_at`, `updated_at`, `activation_digest`) VALUES ('enternicky@126.com', '$2a$10$NCwZhM9MYov/uzu9pJDEUeQtp8y3rwq5hNBm4DVdZVME5zNa2j2Ly', '13213213211', '2016-03-29 13:49:28', '2016-03-29 13:49:28', '$2a$10$PR/nUsZbG9xlln89g1KSbuTl1Pr8Sy/AuiL5B2csO4uCvpCZcqHP6')
---
  def create
    @user = User.new(user_params)
    if @user.save