app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'send_group_emails' LIMIT 1
---
  def show

    type = params[:type] || 'topic'

    case type
      when 'topic'
        @user = User.includes(:topics).find_by_username(params[:id])